Repository: aib/glito
Catalog: po/*.po
Languages: eo, fr

source: Choose a directory for fast saving
eo: Elektu dosieron por rapida registro
fr: Sélectionnez un répertoire pour la sauvegarde rapide

source: You did not enter a valid directory: %s
eo: Tiu dosierujo ne validas: %s
fr: Le répertoire n'est pas valide : %s

source: Saving PNG file failed.
eo: Registro de PNG-a dosiero malsukcesis.
fr: La sauvegarde du fichier PNG a échoué.

source: Pick a file
eo: Elektu dosieron
fr: Sélectionnez un fichier

source: Saving MNG file failed.
eo: Registro de MNG-a dosiero malsukcesis.
fr: La sauvegarde du fichier MNG a échoué.

source: press ESC to continue
eo: premu ESC (eskapa klavo) por pluigi
fr: presser Echap pour continuer

source: Can not remove this function. The system must contain 1 function at least.
eo: Ne eblas forpreni tiun funkcion. La sistemo bezonas almenaux 1 funkcion.
fr: Cette fonction ne peut pas être supprimée. Le système doit contenir au moins une fonction.

source: Can not paste this function. The number of functions can not exceed %d.
eo: Ne eblas aldoni tiun funkcion. La maksimuma kvanto da funkcioj estas %d.
fr: Cette fonction ne peut pas être collée. Le nombre de fonctions ne peut pas excéder %d.

source: System to slow to show %d frames per second.
eo: Sistemo tro malrapida por montri %d bildojn po sekundo.
fr: Système trop lent pour afficher %d images par seconde.

source: one color
eo: fonkoloro
fr: une couleur

source: alpha
eo: alfa

source: none
eo: nenia
fr: aucune

source: Glito is free software.
eo: Glito estas libera programo.
fr: Glito est un logiciel libre.

source: Saving BMP file
eo: Registrante BMP-an dosieron
fr: Sauvegarde de fichier BMP

source: Saving PNG file
eo: Registrante PNG-an dosieron
fr: Sauvegarde de fichier PNG

source: Saving MNG file
eo: Registrante MNG-an dosieron
fr: Sauvegarde de fichier MNG

source: Open Skeleton
eo: Legi skeleton
fr: Ouvrir un squelette

source: Failed to open "%s".
eo: Lego de "%s" malsukcesis.
fr: Echec de l'ouverture de "%s".

source: Save Skeleton
eo: Registri skeleton
fr: Sauver un squelette

source: Export Skeleton to Fractint
eo: Registri skeleton Fractint-e
fr: Exporter un squelette vers Fractint

source: Format: '%s' Resolution: %d x %d Use the arrows on the keyboard to move the image. Press space bar to save the calculated image.
eo: Datenarangxo: '%s' Dimensioj: %d x %d Uzu la sagajn klavojn por vidi la tutan bildon. Premu la spacetan klavon por registri la komputatan bildon.
fr: Format : '%s' Rsolution : %d x %d Utilisez les flèches du clavier pour visualiser toute l'image. Appuyez sur la barre d'espace pour enregistrer l'image calculée.

source: Open Color Map (pov-ray format)
eo: Legi koloraron (pov-ray-a datenarangxo)
fr: Ouvrir une palette de couleurs (format pov-ray)

source: Open Parameters
eo: Legi parametrojn
fr: Ouvrir les paramètres

source: Save Parameters
eo: Registri parametrojn
fr: Sauver les paramètres

source: Width out of range.
eo: Largxo valorekscesas.
fr: Largeur invalide.

source: Height out of range.
eo: Alto valorekscesas.
fr: Hauteur invalide.

source: Value out of range.
eo: Valoreksceso.
fr: Valeur invalide.

source: Do you want the program to calibrate the number of pixels to calculate for each frame? (Esc to cancel the process)
eo: Cxu vi deziras kalibri auxtomate la kvanton da komputataj bilderoj po bildo? (Premu ESC (eskapa klavo) por halti la komputadon)
fr: Voulez-vous calibrer le nombre de pixels à calculer pour chaque image ? (Echap pour interrompre le processus)

source: How many frames per second?
eo: Kiom da bildoj po sekundo?
fr: Nombre d'images par seconde ?

source: Parameters
eo: Parametroj
fr: Paramètres

source: Schema size:
eo: Dimensioj de la skemo:
fr: Taille du schéma :

source: Preview Size:
eo: Dimensioj de la antauxvido
fr: Taille de prévisualisation :

source: Rotation shift (rad):
eo: Angulo de rotacio (rad):
fr: Angle de rotation (rad) :

source: Size of saved images:
eo: Dimensioj de registritaj bildoj:
fr: Taille des images enregistrées :

source: Size of animations:
eo: Dimensioj de registritaj animacioj:
fr: Taille des animations :

source: Frames per cycle (>1):
eo: Bildoj po ciklo (>1):
fr: Images par cycle (>1) :

source: Motion detection (ms):
eo: Relego de muspozicio (ms):
fr: Détection souris (ms) :

source: Density
eo: Denseco
fr: Densité

source: or pseudo-density:
eo: / Pseuxdo-denseco:
fr: ou pseudo-densité :

source: Points for framing:
eo: Kvanto da iteracioj dum kadrado:
fr: Points pour le cadrage :

source: for animation)
eo: por animacio)
fr: si animation)

source: Number of iterations limited by:
eo: Kvanto da iteracioj limigitaj per:
fr: Nombre d'itérations limité par :

source: Interval per frame (ms)
eo: Tempo po bildo (ms)
fr: Intervalle par image (ms)

source: Points per frame
eo: Iteracioj po bildo
fr: Points par image

source: Calibrate
eo: Kalibri
fr: Calibrer

source: Black/White
eo: Nigra/Blanka
fr: Noir/Blanc

source: Transparency:
eo: Travideco:
fr: Transparence :

source: Number of functions (1->%d) ?
eo: Kvanto da funkcioj (1->%d)?
fr: Nombre de fonctions (1->%d) ?

source: The number of functions must be between 1 and %d
eo: La kvanto da funkcioj devas esti inter 1 kaj %d.
fr: Le nombre de fonctions doit être entre 1 et %d

source: Error occured during parsing: %s
eo: Eraro okazis dum traduko de formulo: %s
fr: Une erreur est survenue lors de la traduction de la formule: %s

source: Formulas editor
eo: Tajpilo de formuloj
fr: Editeur de formules

source: Enter the formulas of x(n+1) and y(n+1) using prefix notation.
eo: Tajpu la formulojn de x(n+1) kaj y(n+1) per prefiksa skribo.
fr: Modifiez les formules de x(n+1) et y(n+1) en utilisant le notation préfixée.

source: Variables: x y x1 x2 y1 y2 xc yc rand, and any number.
eo: Variabloj: x y x1 x2 y1 y2 xc yc rand, kaj iu ajn kvanto.
fr: Variables : x y x1 x2 y1 y2 xc yc rand, et tout nombre.

source: Functions:
eo: Funkcioj:
fr: Fonctions :

source: Set formulas
eo: Validigi formulojn
fr: Valider formules

source: To zoom inside the general frame is not allowed!
eo: Ne eblas zomi en la kadra funkcio!
fr: Il n'est pas possible de zoomer dans la fonction de cadrage !

source: Selected function is not contracting!
eo: La selektata funkcio ne estas kuntiro!
fr: La fonction sélectionnée n'est pas contractante !

source: The zoom animation requires a "linear" system.
eo: La zoma animacio bezonas "linearan" sistemon.
fr: L'animation "zoom" nÃ©cessite un système "linéaire".

source: Memory 1 and 2 must have the same number of functions!
eo: Memoroj 1 kaj 2 ne havas la saman kvanton da funkcioj!
fr: Les mémoires 1 et 2 doivent avoir le même nombre de fonctions !

source: Format: '%s' Resolution: %d x %d Press space bar to cancel calculation.
eo: Datenarangxo: '%s' Dimensioj: %d x %d Premu la spacetan klavon por nuligi la komputadon.
fr: Format : '%s' Résolution : %d x %d Pressez la barre d'espace pour annuler l'enregistrement.

source: Glito comes with absolutely no warranty. Glito is free software. For details, click on Help -> Documentation.
eo: Glito kunportas neniun garantion. Glito estas libera programo. Por detaloj, alklaku Helpo->Dokumento.
fr: Glito vient sans aucune garantie. Glito est un logiciel libre. Pour plus d'informations : Aide->Documentation.

source: Usage:
eo: Uzo:
fr: Utilisation :

source: paramFile
eo: paramDosiero
fr: fichierParam

source: skeletonFile
eo: skeletDosiero
fr: fichierSquelette

source: Report bugs to <glito@debanne.net>.
eo: Sendu problemojn al <glito@debanne.net>.
fr: Transmettre les bogues à <glito@debanne.net>.

source: No
eo: Ne
fr: Non

source: OK
eo: Yes
fr: Valider

source: Cancel
eo: Nuligi
fr: Annuler

source: Close
eo: Fermi
fr: Fermer

source: Add to Favorites
eo: Plejpreferatigi
fr: Ajouter aux favoris

source: All Files (*)
eo: Cxiuj dosieroj (*)
fr: Tous les fichiers (*)

source: Custom Filter
eo: Filtro
fr: Filtre

source: Favorites
eo: Plejpreferataj
fr: Favoris

source: Filename:
eo: Dosiero:
fr: Fichier :

source: My Computer
eo: Mia komputilo
fr: Mon ordinateur

source: File Systems
eo: Dosierujoj
fr: Systèmes de fichier

source: Manage Favorites
eo: Arangxi plejprefaratajn
fr: Gérer les favoris

source: Preview
eo: Antauxvido
fr: Prévisualisation

source: Show:
eo: Montru:
fr: Voir :

source: Glito is distributed under the terms of the GNU General Public License.
eo: Glito estas eldonata laux la GNUa Gxenerala Publika Permesilo.
fr: Glito est distribué sous les termes de la License Publique Générale GNU.

source: Failed to open:
eo: Malsukcesis la lego de:
fr: Echec de l'ouverture de :

source: manual_en.html
eo: manual_eo.html
fr: manual_fr.html

source: &File
eo: &Dosiero
fr: &Fichier

source: &Open
eo: &Legi
fr: &Ouvrir

source: &Save
eo: &Registri
fr: &Sauver

source: &Export to Fractint
eo: R&egistri Fractint-e
fr: &Exporter vers Fractint

source: Set Fast Save Directory
eo: Dosiero por rapida registro
fr: Répertoire sauvegarde rapide

source: Fast Save
eo: Registri rapide
fr: Sauvegarde rapide

source: Save PNG
eo: Registri PNG
fr: Sauver PNG

source: Save PGM
eo: Registri PGM
fr: Sauver PGM

source: Save BMP bitmap
eo: Registri unubita BMP
fr: Sauver BMP 1 bit

source: Save BMP gray
eo: Registri okbita BMP
fr: Sauver BMP 8 bits

source: Edit &Paramaters
eo: Modifi &parametrojn
fr: Editer &paramètres

source: Open Paramaters
eo: Legi parametrojn
fr: Ouvrir paramètres

source: Sa&ve parameters
eo: &Registri parametrojn
fr: Sau&ver paramètres

source: &Quit
eo: &Adiaux
fr: &Quitter

source: &Skeleton
eo: &Skeleto
fr: &Squelette

source: &New
eo: &Nova
fr: &Nouveau

source: &Random
eo: &Hazarde
fr: &Aléatoire

source: &Dimension
eo: &Dimensio

source: &Coordinates
eo: &Koordinatoj
fr: &Coordonnées

source: out Memory1
eo: Legi memoron 1
fr: Lire Mémoire 1

source: out Memory2
eo: Legi memoron 2
fr: Lire Mémoire 2

source: out Memory3
eo: Legi memoron 3
fr: Lire Mémoire 3

source: out Memory4
eo: Legi memoron 4
fr: Lire Mémoire 4

source: in Memory1
eo: Skribi memoron 1
fr: Sauver Mémoire 1

source: in Memory2
eo: Skribi memoron 2
fr: Sauver Mémoire 2

source: in Memory3
eo: Skribi memoron 3
fr: Sauver Mémoire 3

source: in Memory4
eo: Skribi memoron 4
fr: Sauver Mémoire 4

source: &Function
eo: &Funkcio
fr: &Fonction

source: Pre&vious
eo: &Antauxa
fr: &Précédent

source: &Next
eo: &Posta
fr: S&uivant

source: &Cut
eo: &Forpreni
fr: &Couper

source: C&opy
eo: &Kopii
fr: C&opier

source: &Paste
eo: &Aldoni
fr: Coll&er

source: &Reshape
eo: &Kvadratigi
fr: Ca&rré

source: &Linear
eo: &Lineara
fr: &Linéaire

source: &Sinusoidal
eo: &Sinusoida
fr: &Sinusoïdal

source: &Formulas
eo: &Formuloj
fr: &Formules

source: &Edit Formulas
eo: &Sxangxi formulojn
fr: &Editer formules

source: &Color
eo: &Koloro
fr: &Couleur

source: Open Color Map
eo: Legi koloraron
fr: Ouvrir une palette

source: Color / B&W
eo: Koloro / NkB
fr: Couleur / N&B

source: Maps:
eo: Aroj:
fr: Palettes :

source: Autumn
eo: Auxtuno
fr: Automne

source: Fast
eo: Rapida
fr: Rapide

source: CMY
eo: CMF
fr: CMJ

source: RGB
eo: RVB
fr: RVB

source: Light CMY
eo: Hela CMF
fr: CMJ clair

source: Dark
eo: Malhela
fr: Sombre

source: Rich
eo: Ricxa
fr: Riche

source: &Animation
eo: &Animacio
fr: &Animer

source: &Zoom
eo: &Zomado

source: &Transition: Mem1 <-> Mem2
eo: &Transformo: Mem1 <-> Mem2
fr: &Transition : Mm1 <-> Mm2

source: &Rotation
eo: &Rivoluo

source: &Stop
eo: &Halti
fr: &Arrêter

source: Save Zoom as MNG
eo: Registri zomadon MNG
fr: Sauver zoom MNG

source: Save Transition as MNG
eo: Registri transformon MNG
fr: Sauver transition MNG

source: Save Rotation as MNG
eo: Registri rivoluo MNG
fr: Sauver rotation MNG

source: &Help
eo: &Helpo
fr: &Aide

source: Docu&mentation
eo: Doku&mento

source: &Demo
eo: &Prezenta animacio
fr: &Démo

source: &About
eo: &Pri
fr: &A propos

source: Open
eo: Legi
fr: Ouvrir

source: Fast save
eo: Registri rapide
fr: Sauvegarde rapide

source: Random
eo: Hazarde
fr: Aléatoire

source: Previous function
eo: Antauxa funkcio
fr: Fonction précédente

source: Next function
eo: Sekva funkcio
fr: Fonction suivante

source: Enlarge
eo: Plenfenestre
fr: Agrandir

source: Rot/Dil
eo: Rot/Hom
fr: Rot/Hom

source: Yes
fr: Oui

source: Please choose an existing file!
fr: Sélectionnez un répertoire existant !
